Revit 2027 API
ShapeImporter.DefaultLengthUnit Property
 The length unit to be used if not specified when the input is a unitless SAT file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ImportUnit DefaultLengthUnit { get; }
Public ReadOnly Property DefaultLengthUnit As ImportUnit
	Get
public:
property ImportUnit DefaultLengthUnit {
	ImportUnit get ();
}
member DefaultLengthUnit : ImportUnit with get
Property Value
ImportUnit
Remarks
 If the input is a unitless SAT file then this length unit will be used as a backup.
See Also
Reference
ShapeImporter Class
Autodesk.Revit.DB Namespace